InformationRegisters/ФССП_СостояниеИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ФССП_СостояниеИП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>bailiff</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>department</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>subject</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ip_end</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>exe_production</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>details</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусИП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФССП_СтатусыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтделСудебныхПриставов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_СлужбыСудебныхПриставов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СудебныйПриставИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СудебныеПриставы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаОкончания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет2</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Предмет3</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ПредметыИП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиИП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ХарактеристикиИП</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсполнительноеПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиИП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ХарактеристикиИД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиИД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ХарактеристикиИД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИсполнительныйДокумент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ХарактеристикиИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФССП_СтатусыИП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ФССП_СтатусыИП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Действующее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоИсполнением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОконченоБезИсполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утерян</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтзывИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ФССП_ИсполнительноеПроизводство.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ФССП_ИсполнительноеПроизводство</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
			<BasedOn>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерИД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДолговоеОбязательствоИП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СПИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтделССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеВыезда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветчикФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозбуждения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормализованныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ФССП_СостояниеИП/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	//КазанцевЯА , в документе Корректировка регистров он там отсутствует реквизит на который идет проверка
	//Документ Корректировка регистров является также регистратором данного регистра, но не должен подстраиваться под логику,а вносить коррективы из ТЧ 
	МетаданныеОбъекта = ЭтотОбъект.Отбор.Регистратор.Значение.Метаданные();
	Если ЭтотОбъект.Количество() > 0 Тогда
		Для Каждого стр Из ЭтотОбъект Цикл
			ЗаписатьХарактеристикиИП(стр);
			ЗаписатьХарактеристикиИД(стр);
		КонецЦикла;
	ИначеЕсли МетаданныеОбъекта.Реквизиты.Найти("Займ") <> Неопределено Тогда
			ДолжникИП = ЭтотОбъект.Отбор.Регистратор.Значение.Должник;
			ОбновитьХарактеристикиИП_Должник(ДолжникИП);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьХарактеристикиИП(стр)
	Набор = РегистрыСведений.ХарактеристикиИП.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительноеПроизводство.Установить(стр.ИП);
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ДатаОкончания;
	Запись.Значение = стр.ДатаОкончания;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.НомерСводногоДела;
	Запись.Значение = стр.НомерСД;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ОтделСудебныхПриставов;
	Запись.Значение = стр.ОтделСудебныхПриставов;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.СудебныйПристав;
	Запись.Значение = стр.СудебныйПриставИсполнитель;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.ПричинаОкончания;
	Запись.Значение = стр.ПричинаОкончания;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Предмет1;
	Запись.Значение = стр.Предмет1;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Сумма1;
	Запись.Значение = стр.Сумма1;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Предмет2;
	Запись.Значение = стр.Предмет2;
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Сумма2;
	Запись.Значение = стр.Сумма2;	
	
	Запись = Набор.Добавить();
	Запись.ИсполнительноеПроизводство = стр.ИП;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИП.Статус;
	Запись.Значение = стр.СтатусИП;
	
	Набор.Записать();	
КонецПроцедуры

Процедура ЗаписатьХарактеристикиИД(стр)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИП
	                      |ПОМЕСТИТЬ вт
	                      |ИЗ
	                      |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |ГДЕ
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД = &НомерИД
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	вт.ИП.Ссылка КАК ИПСсылка
	                      |ИЗ
	                      |	вт КАК вт
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	вт.ИП.ДатаВозбуждения УБЫВ");
	Запрос.УстановитьПараметр("НомерИД", стр.НомерИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнееИП = Результат.ИПСсылка;
	Иначе
		ПоследнееИП = Справочники.ФССП_ИсполнительноеПроизводство.ПустаяСсылка();
	КонецЕсли;
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФССП_СостояниеИПСрезПоследних.ИП КАК ИП
	               |ПОМЕСТИТЬ вт
	               |ИЗ
	               |	РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	               |ГДЕ
	               |	ФССП_СостояниеИПСрезПоследних.НомерИД = &НомерИД
	               |	И ФССП_СостояниеИПСрезПоследних.СтатусИП = &СтатусИП
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	вт.ИП.Ссылка КАК ИПСсылка
	               |ИЗ
	               |	вт КАК вт
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	вт.ИП.ДатаВозбуждения УБЫВ";
	Запрос.УстановитьПараметр("СтатусИП", Перечисления.ФССП_СтатусыИП.Действующее);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ПоследнееДействующееИП = Результат.ИПСсылка;
	Иначе
		ПоследнееДействующееИП = Справочники.ФССП_ИсполнительноеПроизводство.ПустаяСсылка();
	КонецЕсли;
	
	Набор = РегистрыСведений.ХарактеристикиИД.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительныйДокумент.Установить(стр.НомерИД);
	Набор.Отбор.Свойство.Установить(ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееИП);	
	Запись = Набор.Добавить();
	Запись.ИсполнительныйДокумент = стр.НомерИД;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееИП;
	Запись.Значение = ПоследнееИП;	
	Набор.Записать();
	
	
	Набор = РегистрыСведений.ХарактеристикиИД.СоздатьНаборЗаписей();
	Набор.Отбор.ИсполнительныйДокумент.Установить(стр.НомерИД);
	Набор.Отбор.Свойство.Установить(ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееДействующееИП);	
	Запись = Набор.Добавить();
	Запись.ИсполнительныйДокумент = стр.НомерИД;
	Запись.Свойство = ПланыВидовХарактеристик.ХарактеристикиИД.ПоследнееДействующееИП;
	Запись.Значение = ПоследнееДействующееИП;	
	Набор.Записать();	

КонецПроцедуры

Процедура ОбновитьХарактеристикиИП_Должник(ДолжникИП)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ФССП_ИсполнительноеПроизводство.Ссылка КАК ИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Период КАК Период,
	                      |	ФССП_СостояниеИПСрезПоследних.Регистратор КАК Регистратор,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСтроки КАК НомерСтроки,
	                      |	ФССП_СостояниеИПСрезПоследних.Активность КАК Активность,
	                      |	ФССП_СостояниеИПСрезПоследних.СтатусИП КАК СтатусИП,
	                      |	ФССП_СостояниеИПСрезПоследних.Завершено КАК Завершено,
	                      |	ФССП_СостояниеИПСрезПоследних.ОтделСудебныхПриставов КАК ОтделСудебныхПриставов,
	                      |	ФССП_СостояниеИПСрезПоследних.СудебныйПриставИсполнитель КАК СудебныйПриставИсполнитель,
	                      |	ФССП_СостояниеИПСрезПоследних.ПричинаОкончания КАК ПричинаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаОкончания КАК ДатаОкончания,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет1 КАК Предмет1,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма1 КАК Сумма1,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет2 КАК Предмет2,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма2 КАК Сумма2,
	                      |	ФССП_СостояниеИПСрезПоследних.Предмет3 КАК Предмет3,
	                      |	ФССП_СостояниеИПСрезПоследних.Сумма3 КАК Сумма3,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерИД КАК НомерИД,
	                      |	ФССП_СостояниеИПСрезПоследних.НомерСД КАК НомерСД,
	                      |	ФССП_СостояниеИПСрезПоследних.ДатаВозбуждения КАК ДатаВозбуждения
	                      |ИЗ
	                      |	Справочник.ФССП_ИсполнительноеПроизводство КАК ФССП_ИсполнительноеПроизводство
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФССП_СостояниеИП.СрезПоследних(&ТекущаяДата) КАК ФССП_СостояниеИПСрезПоследних
	                      |		ПО (ФССП_СостояниеИПСрезПоследних.ИП = ФССП_ИсполнительноеПроизводство.Ссылка)
	                      |ГДЕ
	                      |	ФССП_ИсполнительноеПроизводство.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", ДолжникИП);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		ЗаписатьХарактеристикиИП(Результат);
		ЗаписатьХарактеристикиИД(Результат);
	КонецЦикла;
КонецПроцедуры
